Masmiseim36/nxpSDK/devices/MKV42F16/MKV42F16_features.h
/* @brief Maximum value of AOI input mux. */
#define FSL_FEATURE_AOI_MODULE_INPUTS (4)
/* @brief Number of AOI events (related to number of registers AOI_BFCRT01n/AOI_BFCRT23n). */
#define FSL_FEATURE_AOI_EVENT_COUNT (4)

/* FLEXCAN module features */

#if defined(CPU_MKV42F128VLF16) || defined(CPU_MKV42F64VLF16)
    /* @brief Message buffer size */
    #define FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(x) (16)
    /* @brief Has doze mode support (register bit field MCR[DOZE]). */
    #define FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT (1)
    /* @brief Insatnce has doze mode support (register bit field MCR[DOZE]). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_DOZE_MODE_SUPPORTn(x) (1)
    /* @brief Has a glitch filter on the receive pin (register bit field MCR[WAKSRC]). */
    #define FSL_FEATURE_FLEXCAN_HAS_GLITCH_FILTER (1)
    /* @brief Has extended interrupt mask and flag register (register IMASK2, IFLAG2). */
    #define FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER (0)
    /* @brief Instance has extended bit timing register (register CBT). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_EXTENDED_TIMING_REGISTERn(x) (1)
    /* @brief Has a receive FIFO DMA feature (register bit field MCR[DMA]). */
    #define FSL_FEATURE_FLEXCAN_HAS_RX_FIFO_DMA (1)
    /* @brief Instance has a receive FIFO DMA feature (register bit field MCR[DMA]). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_RX_FIFO_DMAn(x) (1)
    /* @brief Has separate message buffer 0 interrupt flag (register bit field IFLAG1[BUF0I]). */
    #define FSL_FEATURE_FLEXCAN_HAS_SEPARATE_BUFFER_0_FLAG (1)
    /* @brief Has bitfield name BUF31TO0M. */
    #define FSL_FEATURE_FLEXCAN_HAS_BUF31TO0M (1)
    /* @brief Number of interrupt vectors. */
    #define FSL_FEATURE_FLEXCAN_INTERRUPT_COUNT (6)
    /* @brief Is affected by errata with ID 5641 (Module does not transmit a message that is enabled to be transmitted at a specific moment during the arbitration process). */
    #define FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641 (0)
#elif defined(CPU_MKV42F128VLH16) || defined(CPU_MKV42F128VLL16) || defined(CPU_MKV42F256VLH16) || defined(CPU_MKV42F256VLL16) || \
    defined(CPU_MKV42F64VLH16)
    /* @brief Message buffer size */
    #define FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(x) (16)
    /* @brief Has doze mode support (register bit field MCR[DOZE]). */
    #define FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT (1)
    /* @brief Insatnce has doze mode support (register bit field MCR[DOZE]). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_DOZE_MODE_SUPPORTn(x) (1)
    /* @brief Has a glitch filter on the receive pin (register bit field MCR[WAKSRC]). */
    #define FSL_FEATURE_FLEXCAN_HAS_GLITCH_FILTER (1)
    /* @brief Has extended interrupt mask and flag register (register IMASK2, IFLAG2). */
    #define FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER (0)
    /* @brief Instance has extended bit timing register (register CBT). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_EXTENDED_TIMING_REGISTERn(x) (1)
    /* @brief Has a receive FIFO DMA feature (register bit field MCR[DMA]). */
    #define FSL_FEATURE_FLEXCAN_HAS_RX_FIFO_DMA (1)
    /* @brief Instance has a receive FIFO DMA feature (register bit field MCR[DMA]). */
    #define FSL_FEATURE_FLEXCAN_INSTANCE_HAS_RX_FIFO_DMAn(x) (1)
    /* @brief Has separate message buffer 0 interrupt flag (register bit field IFLAG1[BUF0I]). */
    #define FSL_FEATURE_FLEXCAN_HAS_SEPARATE_BUFFER_0_FLAG (1)
    /* @brief Has bitfield name BUF31TO0M. */
    #define FSL_FEATURE_FLEXCAN_HAS_BUF31TO0M (1)
    /* @brief Number of interrupt vectors. */
    #define FSL_FEATURE_FLEXCAN_INTERRUPT_COUNT (6)
    /* @brief Is affected by errata with ID 5641 (Module does not transmit a message that is enabled to be transmitted at a specific moment during the arbitration process). */
    #define FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641 (0)
#endif /* defined(CPU_MKV42F128VLF16) || defined(CPU_MKV42F64VLF16) */

/* CMP module features */

/* @brief Has Trigger mode in CMP (register bit field CR1[TRIGM]). */
#define FSL_FEATURE_CMP_HAS_TRIGGER_MODE (1)
/* @brief Has Window mode in CMP (register bit field CR1[WE]). */
#define FSL_FEATURE_CMP_HAS_WINDOW_MODE (1)
/* @brief Has External sample supported in CMP (register bit field CR1[SE]). */
#define FSL_FEATURE_CMP_HAS_EXTERNAL_SAMPLE_SUPPORT (1)
/* @brief Has DMA support in CMP (register bit field SCR[DMAEN]). */
#define FSL_FEATURE_CMP_HAS_DMA (1)
/* @brief Has Pass Through mode in CMP (register bit field MUXCR[PSTM]). */
#define FSL_FEATURE_CMP_HAS_PASS_THROUGH_MODE (0)
/* @brief Has DAC Test function in CMP (register DACTEST). */
#define FSL_FEATURE_CMP_HAS_DAC_TEST (0)

/* CRC module features */

/* @brief Has data register with name CRC */
#define FSL_FEATURE_CRC_HAS_CRC_REG (0)

/* EDMA module features */

/* @brief Number of DMA channels (related to number of registers TCD, DCHPRI, bit fields ERQ[ERQn], EEI[EEIn], INT[INTn], ERR[ERRn], HRS[HRSn] and bit field widths ES[ERRCHN], CEEI[CEEI], SEEI[SEEI], CERQ[CERQ], SERQ[SERQ], CDNE[CDNE], SSRT[SSRT], CERR[CERR], CINT[CINT], TCDn_CITER_ELINKYES[LINKCH], TCDn_CSR[MAJORLINKCH], TCDn_BITER_ELINKYES[LINKCH]). (Valid only for eDMA modules.) */
#define FSL_FEATURE_EDMA_MODULE_CHANNEL (16)
/* @brief Total number of DMA channels on all modules. */
#define FSL_FEATURE_EDMA_DMAMUX_CHANNELS (FSL_FEATURE_SOC_EDMA_COUNT * 16)
/* @brief Number of DMA channel groups (register bit fields CR[ERGA], CR[GRPnPRI], ES[GPE], DCHPRIn[GRPPRI]). (Valid only for eDMA modules.) */
#define FSL_FEATURE_EDMA_CHANNEL_GROUP_COUNT (1)
/* @brief Has DMA_Error interrupt vector. */
#define FSL_FEATURE_EDMA_HAS_ERROR_IRQ (1)
/* @brief Number of DMA channels with asynchronous request capability (register EARS). (Valid only for eDMA modules.) */
#define FSL_FEATURE_EDMA_ASYNCHRO_REQUEST_CHANNEL_COUNT (16)
/* @brief Channel IRQ entry shared offset. */
#define FSL_FEATURE_EDMA_MODULE_CHANNEL_IRQ_ENTRY_SHARED_OFFSET (0)
/* @brief If 8 bytes transfer supported. */
#define FSL_FEATURE_EDMA_SUPPORT_8_BYTES_TRANSFER (0)
/* @brief If 16 bytes transfer supported. */
#define FSL_FEATURE_EDMA_SUPPORT_16_BYTES_TRANSFER (1)

/* DMAMUX module features */

/* @brief Number of DMA channels (related to number of register CHCFGn). */
#define FSL_FEATURE_DMAMUX_MODULE_CHANNEL (16)
/* @brief Total number of DMA channels on all modules. */
#define FSL_FEATURE_DMAMUX_DMAMUX_CHANNELS (FSL_FEATURE_SOC_DMAMUX_COUNT * 16)
/* @brief Has the periodic trigger capability for the triggered DMA channel (register bit CHCFG0[TRIG]). */
#define FSL_FEATURE_DMAMUX_HAS_TRIG (1)

/* ENC module features */

/* No feature definitions */

/* EWM module features */

/* @brief Has clock select (register CLKCTRL). */
#define FSL_FEATURE_EWM_HAS_CLOCK_SELECT (0)
/* @brief Has clock prescaler (register CLKPRESCALER). */
#define FSL_FEATURE_EWM_HAS_PRESCALER (0)

/* FLASH module features */

